package by.htp.les02.hometask;

/*7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника  */

public class Task7 {

	public static void main(String[] args) {
		int a = 2;
		int b;
		
		int s;
		
		b = a * 2;
		s = a * b;
		
		System.out.println("s = " + s);

	}

}
